tests/files/test_soap.xml

 <?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <SearchAvailabilityOneLocationRequest xmlns="http://schemas.livebookings.net/OneFormat/Aggregator/External/1/0/">
      <SessionId>secret_id</SessionId>
    </SearchAvailabilityOneLocationRequest>
  </soap:Body>
</soap:Envelope>
